app/views/books/_book.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
		<%= link_to book_favorites_path(book, redirect_id: 0), method: :delete, remote: true do %>
        	<span class="glyphicon glyphicon-heart"><%= book.favorites.count%></span>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 6]]
---
        <%= link_to book_favorites_path(book, redirect_id: 0), method: :post, remote: true do %>
            <span class="glyphicon glyphicon-heart-empty"><%= book.favorites.count %></span>

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---
</td>
<td>コメント数：<%= book.book_comments.count %></td>