app/controllers/book_comments_controller.rb

  	def create
    	@book = Book.find(params[:book_id])
    	@book_new = Book.new
    	@book_comment = @book.book_comments.new(book_comment_params)
    	@book_comment.user_id = current_user.id
    	if @book_comment.save
      		flash[:success] = "Comment was successfully created."
    	else
      		@book_comments = BookComment.where(id: @book)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "楽しそうですね"], ["user_id", 2], ["book_id", 5], ["created_at", "2020-07-07 12:28:25.544581"], ["updated_at", "2020-07-07 12:28:25.544581"]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]

  	def destroy
    	@book_comment = BookComment.find(params[:book_id])
    	@book = @book_comment.book
    	if @book_comment.user != current_user
      		redirect_to request.referer
    	end
    	@book_comment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 22]]