app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
  	@users = User.all #一覧表示するためにUserモデルのデータを全て変数に入れて取り出す。

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["profile_image_id", nil], ["updated_at", "2020-07-06 11:40:28.326320"], ["id", 2]]
---
  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)